package day1;

public class Lesson_1 {
    /*
    JDBC - Java Database Connectivity - это что-то типа посредника между джавой и sql. Служит для того чтобы
    со стороны джавы писать команды(запросы, создавать таблицы и т.д), а со стороны базы данных предоставлять их.

    JDBC - складывается с блоков, и один самый главный из них это JDBC API в котором находмтся приктически
    все(классы, интерфейы) для полного использования базы данных.

    Есть там такой класс который называется JDBC Driver Manager который служит для определния СУБД и переключении
    между ними. С этого входит что для всех СУБД на стороне джавы все будет происходить одинаково, неважно является ли СУБД
    Postgres, MySql, Oracle и т.д
     */
}
